---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.WinderSecondLegTooShortOrRunwidthTooGreatFailure
source: html/a06149f6-9153-0bf9-e9e6-ee8a26d2a125.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.WinderSecondLegTooShortOrRunwidthTooGreatFailure Property

The second leg of winder run is too short or the runwidth is too great.

## Syntax (C#)
```csharp
public static FailureDefinitionId WinderSecondLegTooShortOrRunwidthTooGreatFailure { get; }
```